Segmentation Models: using `tf.keras` framework.
train 21752
val 5438
test 3254
Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
data (InputLayer)               [(None, None, None,  0                                            
__________________________________________________________________________________________________
bn_data (BatchNormalization)    (None, None, None, 4 12          data[0][0]                       
__________________________________________________________________________________________________
zero_padding2d (ZeroPadding2D)  (None, None, None, 4 0           bn_data[0][0]                    
__________________________________________________________________________________________________
conv0 (Conv2D)                  (None, None, None, 6 12544       zero_padding2d[0][0]             
__________________________________________________________________________________________________
bn0 (BatchNormalization)        (None, None, None, 6 256         conv0[0][0]                      
__________________________________________________________________________________________________
relu0 (Activation)              (None, None, None, 6 0           bn0[0][0]                        
__________________________________________________________________________________________________
zero_padding2d_1 (ZeroPadding2D (None, None, None, 6 0           relu0[0][0]                      
__________________________________________________________________________________________________
pooling0 (MaxPooling2D)         (None, None, None, 6 0           zero_padding2d_1[0][0]           
__________________________________________________________________________________________________
stage1_unit1_bn1 (BatchNormaliz (None, None, None, 6 256         pooling0[0][0]                   
__________________________________________________________________________________________________
stage1_unit1_relu1 (Activation) (None, None, None, 6 0           stage1_unit1_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_2 (ZeroPadding2D (None, None, None, 6 0           stage1_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage1_unit1_conv1 (Conv2D)     (None, None, None, 6 36864       zero_padding2d_2[0][0]           
__________________________________________________________________________________________________
stage1_unit1_bn2 (BatchNormaliz (None, None, None, 6 256         stage1_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage1_unit1_relu2 (Activation) (None, None, None, 6 0           stage1_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_3 (ZeroPadding2D (None, None, None, 6 0           stage1_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage1_unit1_conv2 (Conv2D)     (None, None, None, 6 36864       zero_padding2d_3[0][0]           
__________________________________________________________________________________________________
stage1_unit1_sc (Conv2D)        (None, None, None, 6 4096        stage1_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add (Add)                       (None, None, None, 6 0           stage1_unit1_conv2[0][0]         
                                                                 stage1_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage1_unit2_bn1 (BatchNormaliz (None, None, None, 6 256         add[0][0]                        
__________________________________________________________________________________________________
stage1_unit2_relu1 (Activation) (None, None, None, 6 0           stage1_unit2_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_4 (ZeroPadding2D (None, None, None, 6 0           stage1_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage1_unit2_conv1 (Conv2D)     (None, None, None, 6 36864       zero_padding2d_4[0][0]           
__________________________________________________________________________________________________
stage1_unit2_bn2 (BatchNormaliz (None, None, None, 6 256         stage1_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage1_unit2_relu2 (Activation) (None, None, None, 6 0           stage1_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_5 (ZeroPadding2D (None, None, None, 6 0           stage1_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage1_unit2_conv2 (Conv2D)     (None, None, None, 6 36864       zero_padding2d_5[0][0]           
__________________________________________________________________________________________________
add_1 (Add)                     (None, None, None, 6 0           stage1_unit2_conv2[0][0]         
                                                                 add[0][0]                        
__________________________________________________________________________________________________
stage2_unit1_bn1 (BatchNormaliz (None, None, None, 6 256         add_1[0][0]                      
__________________________________________________________________________________________________
stage2_unit1_relu1 (Activation) (None, None, None, 6 0           stage2_unit1_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_6 (ZeroPadding2D (None, None, None, 6 0           stage2_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage2_unit1_conv1 (Conv2D)     (None, None, None, 1 73728       zero_padding2d_6[0][0]           
__________________________________________________________________________________________________
stage2_unit1_bn2 (BatchNormaliz (None, None, None, 1 512         stage2_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage2_unit1_relu2 (Activation) (None, None, None, 1 0           stage2_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_7 (ZeroPadding2D (None, None, None, 1 0           stage2_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage2_unit1_conv2 (Conv2D)     (None, None, None, 1 147456      zero_padding2d_7[0][0]           
__________________________________________________________________________________________________
stage2_unit1_sc (Conv2D)        (None, None, None, 1 8192        stage2_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add_2 (Add)                     (None, None, None, 1 0           stage2_unit1_conv2[0][0]         
                                                                 stage2_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage2_unit2_bn1 (BatchNormaliz (None, None, None, 1 512         add_2[0][0]                      
__________________________________________________________________________________________________
stage2_unit2_relu1 (Activation) (None, None, None, 1 0           stage2_unit2_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_8 (ZeroPadding2D (None, None, None, 1 0           stage2_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage2_unit2_conv1 (Conv2D)     (None, None, None, 1 147456      zero_padding2d_8[0][0]           
__________________________________________________________________________________________________
stage2_unit2_bn2 (BatchNormaliz (None, None, None, 1 512         stage2_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage2_unit2_relu2 (Activation) (None, None, None, 1 0           stage2_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_9 (ZeroPadding2D (None, None, None, 1 0           stage2_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage2_unit2_conv2 (Conv2D)     (None, None, None, 1 147456      zero_padding2d_9[0][0]           
__________________________________________________________________________________________________
add_3 (Add)                     (None, None, None, 1 0           stage2_unit2_conv2[0][0]         
                                                                 add_2[0][0]                      
__________________________________________________________________________________________________
stage3_unit1_bn1 (BatchNormaliz (None, None, None, 1 512         add_3[0][0]                      
__________________________________________________________________________________________________
stage3_unit1_relu1 (Activation) (None, None, None, 1 0           stage3_unit1_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_10 (ZeroPadding2 (None, None, None, 1 0           stage3_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage3_unit1_conv1 (Conv2D)     (None, None, None, 2 294912      zero_padding2d_10[0][0]          
__________________________________________________________________________________________________
stage3_unit1_bn2 (BatchNormaliz (None, None, None, 2 1024        stage3_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage3_unit1_relu2 (Activation) (None, None, None, 2 0           stage3_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_11 (ZeroPadding2 (None, None, None, 2 0           stage3_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage3_unit1_conv2 (Conv2D)     (None, None, None, 2 589824      zero_padding2d_11[0][0]          
__________________________________________________________________________________________________
stage3_unit1_sc (Conv2D)        (None, None, None, 2 32768       stage3_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add_4 (Add)                     (None, None, None, 2 0           stage3_unit1_conv2[0][0]         
                                                                 stage3_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage3_unit2_bn1 (BatchNormaliz (None, None, None, 2 1024        add_4[0][0]                      
__________________________________________________________________________________________________
stage3_unit2_relu1 (Activation) (None, None, None, 2 0           stage3_unit2_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_12 (ZeroPadding2 (None, None, None, 2 0           stage3_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage3_unit2_conv1 (Conv2D)     (None, None, None, 2 589824      zero_padding2d_12[0][0]          
__________________________________________________________________________________________________
stage3_unit2_bn2 (BatchNormaliz (None, None, None, 2 1024        stage3_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage3_unit2_relu2 (Activation) (None, None, None, 2 0           stage3_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_13 (ZeroPadding2 (None, None, None, 2 0           stage3_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage3_unit2_conv2 (Conv2D)     (None, None, None, 2 589824      zero_padding2d_13[0][0]          
__________________________________________________________________________________________________
add_5 (Add)                     (None, None, None, 2 0           stage3_unit2_conv2[0][0]         
                                                                 add_4[0][0]                      
__________________________________________________________________________________________________
stage4_unit1_bn1 (BatchNormaliz (None, None, None, 2 1024        add_5[0][0]                      
__________________________________________________________________________________________________
stage4_unit1_relu1 (Activation) (None, None, None, 2 0           stage4_unit1_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_14 (ZeroPadding2 (None, None, None, 2 0           stage4_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage4_unit1_conv1 (Conv2D)     (None, None, None, 5 1179648     zero_padding2d_14[0][0]          
__________________________________________________________________________________________________
stage4_unit1_bn2 (BatchNormaliz (None, None, None, 5 2048        stage4_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage4_unit1_relu2 (Activation) (None, None, None, 5 0           stage4_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_15 (ZeroPadding2 (None, None, None, 5 0           stage4_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage4_unit1_conv2 (Conv2D)     (None, None, None, 5 2359296     zero_padding2d_15[0][0]          
__________________________________________________________________________________________________
stage4_unit1_sc (Conv2D)        (None, None, None, 5 131072      stage4_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add_6 (Add)                     (None, None, None, 5 0           stage4_unit1_conv2[0][0]         
                                                                 stage4_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage4_unit2_bn1 (BatchNormaliz (None, None, None, 5 2048        add_6[0][0]                      
__________________________________________________________________________________________________
stage4_unit2_relu1 (Activation) (None, None, None, 5 0           stage4_unit2_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_16 (ZeroPadding2 (None, None, None, 5 0           stage4_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage4_unit2_conv1 (Conv2D)     (None, None, None, 5 2359296     zero_padding2d_16[0][0]          
__________________________________________________________________________________________________
stage4_unit2_bn2 (BatchNormaliz (None, None, None, 5 2048        stage4_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage4_unit2_relu2 (Activation) (None, None, None, 5 0           stage4_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_17 (ZeroPadding2 (None, None, None, 5 0           stage4_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage4_unit2_conv2 (Conv2D)     (None, None, None, 5 2359296     zero_padding2d_17[0][0]          
__________________________________________________________________________________________________
add_7 (Add)                     (None, None, None, 5 0           stage4_unit2_conv2[0][0]         
                                                                 add_6[0][0]                      
__________________________________________________________________________________________________
bn1 (BatchNormalization)        (None, None, None, 5 2048        add_7[0][0]                      
__________________________________________________________________________________________________
relu1 (Activation)              (None, None, None, 5 0           bn1[0][0]                        
__________________________________________________________________________________________________
fpn_stage_p5_pre_conv (Conv2D)  (None, None, None, 2 131328      relu1[0][0]                      
__________________________________________________________________________________________________
fpn_stage_p5_upsampling (UpSamp (None, None, None, 2 0           fpn_stage_p5_pre_conv[0][0]      
__________________________________________________________________________________________________
fpn_stage_p5_conv (Conv2D)      (None, None, None, 2 65792       stage4_unit1_relu1[0][0]         
__________________________________________________________________________________________________
fpn_stage_p5_add (Add)          (None, None, None, 2 0           fpn_stage_p5_upsampling[0][0]    
                                                                 fpn_stage_p5_conv[0][0]          
__________________________________________________________________________________________________
fpn_stage_p4_upsampling (UpSamp (None, None, None, 2 0           fpn_stage_p5_add[0][0]           
__________________________________________________________________________________________________
fpn_stage_p4_conv (Conv2D)      (None, None, None, 2 33024       stage3_unit1_relu1[0][0]         
__________________________________________________________________________________________________
fpn_stage_p4_add (Add)          (None, None, None, 2 0           fpn_stage_p4_upsampling[0][0]    
                                                                 fpn_stage_p4_conv[0][0]          
__________________________________________________________________________________________________
fpn_stage_p3_upsampling (UpSamp (None, None, None, 2 0           fpn_stage_p4_add[0][0]           
__________________________________________________________________________________________________
fpn_stage_p3_conv (Conv2D)      (None, None, None, 2 16640       stage2_unit1_relu1[0][0]         
__________________________________________________________________________________________________
fpn_stage_p3_add (Add)          (None, None, None, 2 0           fpn_stage_p3_upsampling[0][0]    
                                                                 fpn_stage_p3_conv[0][0]          
__________________________________________________________________________________________________
fpn_stage_p2_upsampling (UpSamp (None, None, None, 2 0           fpn_stage_p3_add[0][0]           
__________________________________________________________________________________________________
fpn_stage_p2_conv (Conv2D)      (None, None, None, 2 16640       relu0[0][0]                      
__________________________________________________________________________________________________
fpn_stage_p2_add (Add)          (None, None, None, 2 0           fpn_stage_p2_upsampling[0][0]    
                                                                 fpn_stage_p2_conv[0][0]          
__________________________________________________________________________________________________
segm_stage3a_conv (Conv2D)      (None, None, None, 1 294912      fpn_stage_p3_add[0][0]           
__________________________________________________________________________________________________
segm_stage4a_conv (Conv2D)      (None, None, None, 1 294912      fpn_stage_p4_add[0][0]           
__________________________________________________________________________________________________
segm_stage5a_conv (Conv2D)      (None, None, None, 1 294912      fpn_stage_p5_add[0][0]           
__________________________________________________________________________________________________
segm_stage2a_conv (Conv2D)      (None, None, None, 1 294912      fpn_stage_p2_add[0][0]           
__________________________________________________________________________________________________
segm_stage3a_bn (BatchNormaliza (None, None, None, 1 512         segm_stage3a_conv[0][0]          
__________________________________________________________________________________________________
segm_stage4a_bn (BatchNormaliza (None, None, None, 1 512         segm_stage4a_conv[0][0]          
__________________________________________________________________________________________________
segm_stage5a_bn (BatchNormaliza (None, None, None, 1 512         segm_stage5a_conv[0][0]          
__________________________________________________________________________________________________
segm_stage2a_bn (BatchNormaliza (None, None, None, 1 512         segm_stage2a_conv[0][0]          
__________________________________________________________________________________________________
segm_stage3a_relu (Activation)  (None, None, None, 1 0           segm_stage3a_bn[0][0]            
__________________________________________________________________________________________________
segm_stage4a_relu (Activation)  (None, None, None, 1 0           segm_stage4a_bn[0][0]            
__________________________________________________________________________________________________
segm_stage5a_relu (Activation)  (None, None, None, 1 0           segm_stage5a_bn[0][0]            
__________________________________________________________________________________________________
segm_stage2a_relu (Activation)  (None, None, None, 1 0           segm_stage2a_bn[0][0]            
__________________________________________________________________________________________________
segm_stage3b_conv (Conv2D)      (None, None, None, 1 147456      segm_stage3a_relu[0][0]          
__________________________________________________________________________________________________
segm_stage4b_conv (Conv2D)      (None, None, None, 1 147456      segm_stage4a_relu[0][0]          
__________________________________________________________________________________________________
segm_stage5b_conv (Conv2D)      (None, None, None, 1 147456      segm_stage5a_relu[0][0]          
__________________________________________________________________________________________________
segm_stage2b_conv (Conv2D)      (None, None, None, 1 147456      segm_stage2a_relu[0][0]          
__________________________________________________________________________________________________
segm_stage3b_bn (BatchNormaliza (None, None, None, 1 512         segm_stage3b_conv[0][0]          
__________________________________________________________________________________________________
segm_stage4b_bn (BatchNormaliza (None, None, None, 1 512         segm_stage4b_conv[0][0]          
__________________________________________________________________________________________________
segm_stage5b_bn (BatchNormaliza (None, None, None, 1 512         segm_stage5b_conv[0][0]          
__________________________________________________________________________________________________
segm_stage2b_bn (BatchNormaliza (None, None, None, 1 512         segm_stage2b_conv[0][0]          
__________________________________________________________________________________________________
segm_stage3b_relu (Activation)  (None, None, None, 1 0           segm_stage3b_bn[0][0]            
__________________________________________________________________________________________________
segm_stage4b_relu (Activation)  (None, None, None, 1 0           segm_stage4b_bn[0][0]            
__________________________________________________________________________________________________
segm_stage5b_relu (Activation)  (None, None, None, 1 0           segm_stage5b_bn[0][0]            
__________________________________________________________________________________________________
segm_stage2b_relu (Activation)  (None, None, None, 1 0           segm_stage2b_bn[0][0]            
__________________________________________________________________________________________________
upsampling_stage3 (UpSampling2D (None, None, None, 1 0           segm_stage3b_relu[0][0]          
__________________________________________________________________________________________________
upsampling_stage4 (UpSampling2D (None, None, None, 1 0           segm_stage4b_relu[0][0]          
__________________________________________________________________________________________________
upsampling_stage5 (UpSampling2D (None, None, None, 1 0           segm_stage5b_relu[0][0]          
__________________________________________________________________________________________________
aggregation_concat (Concatenate (None, None, None, 5 0           segm_stage2b_relu[0][0]          
                                                                 upsampling_stage3[0][0]          
                                                                 upsampling_stage4[0][0]          
                                                                 upsampling_stage5[0][0]          
__________________________________________________________________________________________________
final_stage_conv (Conv2D)       (None, None, None, 1 589824      aggregation_concat[0][0]         
__________________________________________________________________________________________________
final_stage_bn (BatchNormalizat (None, None, None, 1 512         final_stage_conv[0][0]           
__________________________________________________________________________________________________
final_stage_relu (Activation)   (None, None, None, 1 0           final_stage_bn[0][0]             
__________________________________________________________________________________________________
final_upsampling (UpSampling2D) (None, None, None, 1 0           final_stage_relu[0][0]           
__________________________________________________________________________________________________
head_conv (Conv2D)              (None, None, None, 3 3459        final_upsampling[0][0]           
__________________________________________________________________________________________________
linear (Activation)             (None, None, None, 3 0           head_conv[0][0]                  
==================================================================================================
Total params: 13,820,815
Trainable params: 13,810,567
Non-trainable params: 10,248
__________________________________________________________________________________________________
None
